﻿//****************************************************************************
//**                                                                        **
//**            (C)Copyright 1993-2015 Supermicro Computer, Inc.            **
//**                                                                        **
//****************************************************************************
//  File History
//
//  Rev. 1.01
//    Bug Fix:  Support 6 NVMe
//    Reason:   
//    Auditor:  Kasber Chen
//    Date:     Jul/14/2016
//
//  Rev. 1.00
//    Bug Fix:  Initialize revision
//    Reason:   Get base code from Grantley
//    Auditor:  Salmon Chen
//    Date:     Dec/09/2014
//
//****************************************************************************
//****************************************************************************
﻿﻿//**********************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//**********************************************************************
//<AMI_FHDR_START>
//
// Name: PciBus.UNI
//
// Description: Generic PCI Form String Definitions.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"

#string SMC_STR_PCI_FORM			#language eng "PCIe/PCI/PnP Configuration"
#string SMC_STR_PCI_FORM_HELP			#language eng "PCI Hot-Plug Settings"

#string STR_SMC_PCI_SLOT_1_OPROM		#language eng "PCI / PCIX / PCIe Slot 1 OPROM"
#string STR_SMC_PCI_SLOT_1_OPROM_HELP     	#language eng "Enables or disables PCI / PCIX / PCIe Slot 1 OPROM option."
#string STR_SMC_PCI_SLOT_2_OPROM          	#language eng "PCI / PCIX / PCIe Slot 2 OPROM"
#string STR_SMC_PCI_SLOT_2_OPROM_HELP     	#language eng "Enables or disables PCI / PCIX / PCIe Slot 2 OPROM option."
#string STR_SMC_PCI_SLOT_3_OPROM          	#language eng "PCI / PCIX / PCIe Slot 3 OPROM"
#string STR_SMC_PCI_SLOT_3_OPROM_HELP     	#language eng "Enables or disables PCI / PCIX / PCIe Slot 3 OPROM option."
#string STR_SMC_PCI_SLOT_4_OPROM          	#language eng "PCI / PCIX / PCIe Slot 4 OPROM"
#string STR_SMC_PCI_SLOT_4_OPROM_HELP     	#language eng "Enables or disables PCI / PCIX / PCIe Slot 4 OPROM option."
#string STR_SMC_PCI_SLOT_5_OPROM          	#language eng "PCI / PCIX / PCIe Slot 5 OPROM"
#string STR_SMC_PCI_SLOT_5_OPROM_HELP     	#language eng "Enables or disables PCI / PCIX / PCIe Slot 5 OPROM option."
#string STR_SMC_PCI_SLOT_6_OPROM          	#language eng "PCI / PCIX / PCIe Slot 6 OPROM"
#string STR_SMC_PCI_SLOT_6_OPROM_HELP     	#language eng "Enables or disables PCI / PCIX / PCIe Slot 6 OPROM option."
#string STR_SMC_PCI_SLOT_7_OPROM          	#language eng "PCI / PCIX / PCIe Slot 7 OPROM"
#string STR_SMC_PCI_SLOT_7_OPROM_HELP     	#language eng "Enables or disables PCI / PCIX / PCIe Slot 7 OPROM option."
#string STR_SMC_PCI_SLOT_8_OPROM          	#language eng "PCI / PCIX / PCIe Slot 8 OPROM"
#string STR_SMC_PCI_SLOT_8_OPROM_HELP     	#language eng "Enables or disables PCI / PCIX / PCIe Slot 8 OPROM option."
#string STR_SMC_PCI_SLOT_9_OPROM          	#language eng "PCI / PCIX / PCIe Slot 9 OPROM"
#string STR_SMC_PCI_SLOT_9_OPROM_HELP     	#language eng "Enables or disables PCI / PCIX / PCIe Slot 9 OPROM option."
#string STR_SMC_PCI_SLOT_10_OPROM          	#language eng "PCI / PCIX / PCIe Slot 10 OPROM"
#string STR_SMC_PCI_SLOT_10_OPROM_HELP     	#language eng "Enables or disables PCI / PCIX / PCIe Slot 10 OPROM option."
#string STR_SMC_PCI_SLOT_11_OPROM          	#language eng "PCI / PCIX / PCIe Slot 11 OPROM"
#string STR_SMC_PCI_SLOT_11_OPROM_HELP     	#language eng "Enables or disables PCI / PCIX / PCIe Slot 11 OPROM option."

#string STR_LEGACY				#language eng "Legacy"
#string STR_EFI   				#language eng "EFI"
#string STR_BOTH_EFI_LEGACY			#language eng "EFI And Legacy"

#string STR_SMC_ONBOARD_LAN_1_SELECT		#language eng "Onboard LAN1 Option ROM"
#string STR_SMC_ONBOARD_LAN_1_10G_SELECT	#language eng "Onboard LAN1 Option ROM"
#string STR_SMC_ONBOARD_LAN_1_SELECT_HELP	#language eng "Select which firmware function to be loaded for onboard LAN1."
#string STR_SMC_ONBOARD_LAN_2_SELECT		#language eng "Onboard LAN2 Option ROM"
#string STR_SMC_ONBOARD_LAN_2_SELECT_HELP	#language eng "Select which firmware function to be loaded for onboard LAN2"
#string STR_SMC_ONBOARD_LAN_3_SELECT		#language eng "Onboard LAN3 Option ROM"
#string STR_SMC_ONBOARD_LAN_3_SELECT_HELP	#language eng "Select which firmware function to be loaded for onboard LAN3"
#string STR_SMC_ONBOARD_LAN_4_SELECT		#language eng "Onboard LAN4 Option ROM"
#string STR_SMC_ONBOARD_LAN_4_SELECT_HELP	#language eng "Select which firmware function to be loaded for onboard LAN4"
#string STR_SMC_LAN_OPROM_PXE			#language eng "PXE"
#string STR_SMC_LAN_OPROM_ISCSI			#language eng "iSCSI"
#string STR_SMC_LAN_OPROM_FCOE			#language eng "FCoE"
#string STR_SMC_LAN_OPROM_UEFI			#language eng "UEFI Driver"
#string STR_SMC_ONBOARD_SAS_SELECT		#language eng "Onboard SAS Option ROM"
#string STR_SMC_ONBOARD_SAS_SELECT_HELP		#language eng "Enable/Disable onboard SAS firmware to be loaded"
#string STR_SMC_ONBOARD_NVME_1_SELECT		#language eng "Onboard NVMe1 Option ROM"
#string STR_SMC_ONBOARD_NVME_1_SELECT_HELP	#language eng "Select which firmware function to be loaded for onboard NVMe1."
#string STR_SMC_ONBOARD_NVME_2_SELECT		#language eng "Onboard NVMe2 Option ROM"
#string STR_SMC_ONBOARD_NVME_2_SELECT_HELP	#language eng "Select which firmware function to be loaded for onboard NVMe2"
#string STR_SMC_ONBOARD_NVME_3_SELECT		#language eng "Onboard NVMe3 Option ROM"
#string STR_SMC_ONBOARD_NVME_3_SELECT_HELP	#language eng "Select which firmware function to be loaded for onboard NVMe3"
#string STR_SMC_ONBOARD_NVME_4_SELECT		#language eng "Onboard NVMe4 Option ROM"
#string STR_SMC_ONBOARD_NVME_4_SELECT_HELP	#language eng "Select which firmware function to be loaded for onboard NVMe4"
#string STR_SMC_ONBOARD_NVME_5_SELECT		#language eng "Onboard NVMe5 Option ROM"
#string STR_SMC_ONBOARD_NVME_5_SELECT_HELP	#language eng "Select which firmware function to be loaded for onboard NVMe5"
#string STR_SMC_ONBOARD_NVME_6_SELECT		#language eng "Onboard NVMe6 Option ROM"
#string STR_SMC_ONBOARD_NVME_6_SELECT_HELP	#language eng "Select which firmware function to be loaded for onboard NVMe6"
#string STR_SMC_ONBOARD_NVME_7_SELECT		#language eng "Onboard NVMe7 Option ROM"
#string STR_SMC_ONBOARD_NVME_7_SELECT_HELP	#language eng "Select which firmware function to be loaded for onboard NVMe7."
#string STR_SMC_ONBOARD_NVME_8_SELECT		#language eng "Onboard NVMe8 Option ROM"
#string STR_SMC_ONBOARD_NVME_8_SELECT_HELP	#language eng "Select which firmware function to be loaded for onboard NVMe8"
#string STR_SMC_ONBOARD_NVME_9_SELECT		#language eng "Onboard NVMe9 Option ROM"
#string STR_SMC_ONBOARD_NVME_9_SELECT_HELP	#language eng "Select which firmware function to be loaded for onboard NVMe9"
#string STR_SMC_ONBOARD_NVME_10_SELECT		#language eng "Onboard NVMe10 Option ROM"
#string STR_SMC_ONBOARD_NVME_10_SELECT_HELP	#language eng "Select which firmware function to be loaded for onboard NVMe10"
#string STR_SMC_ONBOARD_NVME_11_SELECT		#language eng "Onboard NVMe11 Option ROM"
#string STR_SMC_ONBOARD_NVME_11_SELECT_HELP	#language eng "Select which firmware function to be loaded for onboard NVMe11"
#string STR_SMC_ONBOARD_NVME_12_SELECT		#language eng "Onboard NVMe12 Option ROM"
#string STR_SMC_ONBOARD_NVME_12_SELECT_HELP	#language eng "Select which firmware function to be loaded for onboard NVMe12"
#string STR_ONBOARD_VIDEO_OPROM_PROMPT		#language eng "Onboard Video Option ROM"
#string STR_ONBOARD_VIDEO_OPROM_HELP		#language eng "Select which onboard video firmware type to be loaded."
#string STR_ONBOARD_LAN_OPROM_TYPE_PROMPT	#language eng "Onboard LAN Option ROM Type"
#string STR_ONBOARD_LAN_OPROM_TYPE_HELP		#language eng "Select which firmware type to be loaded for onboard LANs"

//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2009, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************